tutorials/XiFluid/engine2Valve2D/constant/fvModels
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ignition
{
    type            multiCycleConstantbXiIgnition;

    cellZone        ignition;

    period          720;

    start           715;
    duration        15;
    strength        20;
    combustionDuration 245;

    XiCorr
    {
        type            cylindrical;
        cellZone        all;
        thickness       0.05;
        cylinderFraction 1;
    }
}


// ************************************************************************* //
